IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/IOMUX_IOMUX.xml
	<register id="IOMUX_RGMII1_TD0_CFG_REG" acronym="IOMUX_RGMII1_TD0_CFG_REG" offset="0x94" width="32" description="">
		<bitfield id="HSMASTER" width="1" begin="31" end="31" resetval="0x0" description="MMR bits for HSMASTER pin incase of true I2C pads" range="31" rwaccess="RW"/> 
		<bitfield id="HSMODE" width="1" begin="30" end="30" resetval="0x0" description="MMR bits for HSMODE pin incase of true I2C pads" range="30" rwaccess="RW"/> 
		<bitfield id="INP_INV_SEL" width="1" begin="20" end="20" resetval="0x0" description="select value for chosing inverted version of PAD input for chip: 0 : Non Inverted 1 : Inverted" range="20" rwaccess="RW"/> 
		<bitfield id="QUAL_SEL" width="2" begin="19" end="18" resetval="0x0" description="select value for chosing input qualifer type for PAD. 00 : Sync,  01 : 3 Sample qual  10 : 6 Samples qual  11 : Async" range="19 - 18" rwaccess="RW"/> 
		<bitfield id="GPIO_SEL" width="2" begin="17" end="16" resetval="0x0" description="R5F CPU ownership select for GPIO. 0 : GPO0, 1 :GPO1, 2 : GPO2, 3:GPO3" range="17 - 16" rwaccess="RW"/> 
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew rate control : 0 : higher slew rate. 1: Lower slew rate." range="10" rwaccess="RW"/> 
		<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Pullup/PullDown Selection 0 -- Pull Down 1 - Pull Up" range="9" rwaccess="RW"/> 
		<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Active Low Output Override Control : Write 1 to select Active low Output Override value to control IOs OE_N/GZ instead of the control from hardware" range="6" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Active Low Input Override" range="5" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Active Low Input Override Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="RW"/> 
		<bitfield id="FUNC_SEL" width="4" begin="3" end="0" resetval="0x7" description="Function select" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_RGMII1_TD1_CFG_REG" acronym="IOMUX_RGMII1_TD1_CFG_REG" offset="0x98" width="32" description="">
		<bitfield id="HSMASTER" width="1" begin="31" end="31" resetval="0x0" description="MMR bits for HSMASTER pin incase of true I2C pads" range="31" rwaccess="RW"/> 
		<bitfield id="HSMODE" width="1" begin="30" end="30" resetval="0x0" description="MMR bits for HSMODE pin incase of true I2C pads" range="30" rwaccess="RW"/> 
		<bitfield id="INP_INV_SEL" width="1" begin="20" end="20" resetval="0x0" description="select value for chosing inverted version of PAD input for chip: 0 : Non Inverted 1 : Inverted" range="20" rwaccess="RW"/> 
		<bitfield id="QUAL_SEL" width="2" begin="19" end="18" resetval="0x0" description="select value for chosing input qualifer type for PAD. 00 : Sync,  01 : 3 Sample qual  10 : 6 Samples qual  11 : Async" range="19 - 18" rwaccess="RW"/> 
		<bitfield id="GPIO_SEL" width="2" begin="17" end="16" resetval="0x0" description="R5F CPU ownership select for GPIO. 0 : GPO0, 1 :GPO1, 2 : GPO2, 3:GPO3" range="17 - 16" rwaccess="RW"/> 
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew rate control : 0 : higher slew rate. 1: Lower slew rate." range="10" rwaccess="RW"/> 
		<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Pullup/PullDown Selection 0 -- Pull Down 1 - Pull Up" range="9" rwaccess="RW"/> 
		<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Active Low Output Override Control : Write 1 to select Active low Output Override value to control IOs OE_N/GZ instead of the control from hardware" range="6" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Active Low Input Override" range="5" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Active Low Input Override Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="RW"/> 
		<bitfield id="FUNC_SEL" width="4" begin="3" end="0" resetval="0x7" description="Function select" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_RGMII1_TD2_CFG_REG" acronym="IOMUX_RGMII1_TD2_CFG_REG" offset="0x9C" width="32" description="">
		<bitfield id="HSMASTER" width="1" begin="31" end="31" resetval="0x0" description="MMR bits for HSMASTER pin incase of true I2C pads" range="31" rwaccess="RW"/> 
		<bitfield id="HSMODE" width="1" begin="30" end="30" resetval="0x0" description="MMR bits for HSMODE pin incase of true I2C pads" range="30" rwaccess="RW"/> 
		<bitfield id="INP_INV_SEL" width="1" begin="20" end="20" resetval="0x0" description="select value for chosing inverted version of PAD input for chip: 0 : Non Inverted 1 : Inverted" range="20" rwaccess="RW"/> 
		<bitfield id="QUAL_SEL" width="2" begin="19" end="18" resetval="0x0" description="select value for chosing input qualifer type for PAD. 00 : Sync,  01 : 3 Sample qual  10 : 6 Samples qual  11 : Async" range="19 - 18" rwaccess="RW"/> 
		<bitfield id="GPIO_SEL" width="2" begin="17" end="16" resetval="0x0" description="R5F CPU ownership select for GPIO. 0 : GPO0, 1 :GPO1, 2 : GPO2, 3:GPO3" range="17 - 16" rwaccess="RW"/> 
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew rate control : 0 : higher slew rate. 1: Lower slew rate." range="10" rwaccess="RW"/> 
		<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Pullup/PullDown Selection 0 -- Pull Down 1 - Pull Up" range="9" rwaccess="RW"/> 
		<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Active Low Output Override Control : Write 1 to select Active low Output Override value to control IOs OE_N/GZ instead of the control from hardware" range="6" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Active Low Input Override" range="5" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Active Low Input Override Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="RW"/> 
		<bitfield id="FUNC_SEL" width="4" begin="3" end="0" resetval="0x7" description="Function select" range="3 - 0" rwaccess="RW"/>
	</register>
