IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/IOMUX_IOMUX.xml
	<register id="IOMUX_WARMRSTN_CFG_REG" acronym="IOMUX_WARMRSTN_CFG_REG" offset="0x22C" width="32" description="">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew rate control : 0 : higher slew rate. 1: Lower slew rate." range="10" rwaccess="RW"/> 
		<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Pullup/PullDown Selection 0 -- Pull Down 1 - Pull Up" range="9" rwaccess="RW"/> 
		<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x0" description="Active Low Output Override" range="7" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x0" description="Active Low Output Override Control : Write 1 to select Active low Output Override value to control IOs OE_N/GZ instead of the control from hardware" range="6" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x0" description="Active Low Input Override" range="5" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Active Low Input Override Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="RW"/>
	</register>
	<register id="IOMUX_SAFETY_ERRORN_CFG_REG" acronym="IOMUX_SAFETY_ERRORN_CFG_REG" offset="0x230" width="32" description="">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew rate control : 0 : higher slew rate. 1: Lower slew rate." range="10" rwaccess="RW"/> 
		<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Pullup/PullDown Selection 0 -- Pull Down 1 - Pull Up" range="9" rwaccess="RW"/> 
		<bitfield id="PI" width="1" begin="8" end="8" resetval="0x0" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x0" description="Active Low Output Override" range="7" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x0" description="Active Low Output Override Control : Write 1 to select Active low Output Override value to control IOs OE_N/GZ instead of the control from hardware" range="6" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x0" description="Active Low Input Override" range="5" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Active Low Input Override Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="RW"/>
	</register>
	<register id="IOMUX_TDI_CFG_REG" acronym="IOMUX_TDI_CFG_REG" offset="0x234" width="32" description="">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew rate control : 0 : higher slew rate. 1: Lower slew rate." range="10" rwaccess="RW"/> 
		<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x1" description="Pullup/PullDown Selection 0 -- Pull Down 1 - Pull Up" range="9" rwaccess="RW"/> 
		<bitfield id="PI" width="1" begin="8" end="8" resetval="0x0" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Active Low Output Override Control : Write 1 to select Active low Output Override value to control IOs OE_N/GZ instead of the control from hardware" range="6" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x0" description="Active Low Input Override" range="5" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Active Low Input Override Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="RW"/>
	</register>
	<register id="IOMUX_TDO_CFG_REG" acronym="IOMUX_TDO_CFG_REG" offset="0x238" width="32" description="">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew rate control : 0 : higher slew rate. 1: Lower slew rate." range="10" rwaccess="RW"/> 
		<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x1" description="Pullup/PullDown Selection 0 -- Pull Down 1 - Pull Up" range="9" rwaccess="RW"/> 
		<bitfield id="PI" width="1" begin="8" end="8" resetval="0x0" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x0" description="Active Low Output Override" range="7" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x0" description="Active Low Output Override Control : Write 1 to select Active low Output Override value to control IOs OE_N/GZ instead of the control from hardware" range="6" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Active Low Input Override" range="5" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Active Low Input Override Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="RW"/>
	</register>
	<register id="IOMUX_TMS_CFG_REG" acronym="IOMUX_TMS_CFG_REG" offset="0x23C" width="32" description="">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew rate control : 0 : higher slew rate. 1: Lower slew rate." range="10" rwaccess="RW"/> 
		<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x1" description="Pullup/PullDown Selection 0 -- Pull Down 1 - Pull Up" range="9" rwaccess="RW"/> 
		<bitfield id="PI" width="1" begin="8" end="8" resetval="0x0" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x0" description="Active Low Output Override" range="7" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x0" description="Active Low Output Override Control : Write 1 to select Active low Output Override value to control IOs OE_N/GZ instead of the control from hardware" range="6" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x0" description="Active Low Input Override" range="5" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Active Low Input Override Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="RW"/>
	</register>
	<register id="IOMUX_TCK_CFG_REG" acronym="IOMUX_TCK_CFG_REG" offset="0x240" width="32" description="">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x0" description="IO Slew rate control : 0 : higher slew rate. 1: Lower slew rate." range="10" rwaccess="RW"/> 
		<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x1" description="Pullup/PullDown Selection 0 -- Pull Down 1 - Pull Up" range="9" rwaccess="RW"/> 
		<bitfield id="PI" width="1" begin="8" end="8" resetval="0x0" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x0" description="Active Low Output Override" range="7" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x0" description="Active Low Output Override Control : Write 1 to select Active low Output Override value to control IOs OE_N/GZ instead of the control from hardware" range="6" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x0" description="Active Low Input Override" range="5" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Active Low Input Override Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QSPI0_CLKLB_CFG_REG" acronym="IOMUX_QSPI0_CLKLB_CFG_REG" offset="0x244" width="32" description="">
		<bitfield id="SC1" width="1" begin="10" end="10" resetval="0x1" description="IO Slew rate control : 0 : higher slew rate. 1: Lower slew rate." range="10" rwaccess="RW"/> 
		<bitfield id="PUPDSEL" width="1" begin="9" end="9" resetval="0x0" description="Pullup/PullDown Selection 0 -- Pull Down 1 - Pull Up" range="9" rwaccess="RW"/> 
		<bitfield id="PI" width="1" begin="8" end="8" resetval="0x1" description="Pull Inhibit/Pull Disable 0 -- Enable 1- Disable" range="8" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE" width="1" begin="7" end="7" resetval="0x1" description="Active Low Output Override" range="7" rwaccess="RW"/> 
		<bitfield id="OE_OVERRIDE_CTRL" width="1" begin="6" end="6" resetval="0x1" description="Active Low Output Override Control : Write 1 to select Active low Output Override value to control IOs OE_N/GZ instead of the control from hardware" range="6" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE" width="1" begin="5" end="5" resetval="0x1" description="Active Low Input Override" range="5" rwaccess="RW"/> 
		<bitfield id="IE_OVERRIDE_CTRL" width="1" begin="4" end="4" resetval="0x1" description="Active Low Input Override Control : Write 1 to select Active low Input Override value to control IOs IE_N/RXACTIVE_N instead of the control from hardware" range="4" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_0_CFG_REG" acronym="IOMUX_QUAL_GRP_0_CFG_REG" offset="0x248" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_1_CFG_REG" acronym="IOMUX_QUAL_GRP_1_CFG_REG" offset="0x24C" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
