IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/IOMUX_IOMUX.xml
	<register id="IOMUX_QUAL_GRP_2_CFG_REG" acronym="IOMUX_QUAL_GRP_2_CFG_REG" offset="0x250" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_3_CFG_REG" acronym="IOMUX_QUAL_GRP_3_CFG_REG" offset="0x254" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_4_CFG_REG" acronym="IOMUX_QUAL_GRP_4_CFG_REG" offset="0x258" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_5_CFG_REG" acronym="IOMUX_QUAL_GRP_5_CFG_REG" offset="0x25C" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_6_CFG_REG" acronym="IOMUX_QUAL_GRP_6_CFG_REG" offset="0x260" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_7_CFG_REG" acronym="IOMUX_QUAL_GRP_7_CFG_REG" offset="0x264" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_8_CFG_REG" acronym="IOMUX_QUAL_GRP_8_CFG_REG" offset="0x268" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_9_CFG_REG" acronym="IOMUX_QUAL_GRP_9_CFG_REG" offset="0x26C" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_10_CFG_REG" acronym="IOMUX_QUAL_GRP_10_CFG_REG" offset="0x270" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_11_CFG_REG" acronym="IOMUX_QUAL_GRP_11_CFG_REG" offset="0x274" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_12_CFG_REG" acronym="IOMUX_QUAL_GRP_12_CFG_REG" offset="0x278" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_13_CFG_REG" acronym="IOMUX_QUAL_GRP_13_CFG_REG" offset="0x27C" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_14_CFG_REG" acronym="IOMUX_QUAL_GRP_14_CFG_REG" offset="0x280" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_15_CFG_REG" acronym="IOMUX_QUAL_GRP_15_CFG_REG" offset="0x284" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_16_CFG_REG" acronym="IOMUX_QUAL_GRP_16_CFG_REG" offset="0x288" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_QUAL_GRP_17_CFG_REG" acronym="IOMUX_QUAL_GRP_17_CFG_REG" offset="0x28C" width="32" description="">
		<bitfield id="QUAL_PERIOD_PER_SAMPLE" width="8" begin="7" end="0" resetval="0x0" description="MMR bits for programming the qualifier clock count per sample" range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_USER_MODE_EN" acronym="IOMUX_USER_MODE_EN" offset="0x290" width="32" description="">
		<bitfield id="USER_MODE_EN" width="32" begin="31" end="0" resetval="0x0" description="Write 0XADADADAD to enable user mode write access to IO CFG space" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_PADGLBL_CFG_REG" acronym="IOMUX_PADGLBL_CFG_REG" offset="0x294" width="32" description="">
		<bitfield id="PADGLBL_CFG_REG" width="32" begin="31" end="0" resetval="0x0" description="2:0 : global_ie_n_ctl - Write 3'b111 to pass global_ie_n_val to IE_N/RXACTIVE_N pin of all the IOs.3 : global_ie_n_val - Active low10:8 : global_oe_n_ctl - Write 3'b111 to pass global_oe_n_val to OE_N/GZ pin of all the IOs.11 : global_oe_n_val - Active low18:16 : global_pi_ctl - Write 3'b111 to pass global_pi_val and global_pu_val to all the IOs19 : global_pi_val20 : global_pu_val" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_IO_CFG_KICK0" acronym="IOMUX_IO_CFG_KICK0" offset="0x298" width="32" description="">
		<bitfield id="IO_CFG_KICK0" width="32" begin="31" end="0" resetval="0x0" description="Kicker 0 Register. The value 83E7 0B13h must be written to KICK0 as part of the process to unlock the CPU.write access to the above PIN MUX registers (including IOCFGKICK1)" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="IOMUX_IO_CFG_KICK1" acronym="IOMUX_IO_CFG_KICK1" offset="0x29C" width="32" description="">
		<bitfield id="IO_CFG_KICK1" width="32" begin="31" end="0" resetval="0x193" description="Kicker 1 Register. The value 95A4 F1E0h must be written to the KICK1 as part of the process to unlock the CPU write access to above PINMUX registers (excluding IOCFGKICK0). IOCFGKICK0 has to be written with 83E70B13h to enable access to IOCFGKICK1." range="31 - 0" rwaccess="RW"/>
	</register>
</module>